package org.demo0313;

public class homework0313 {

    public static void main(String[] args) {
//    作业1：
//    题目：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一对兔子。假如兔子都不死，要求输出一年内兔子的数量是多少。
//    考点：流程控制
//    难度：中
        int a = 2;
        int b = 2;
//        for (int b = 3 ; b <= 12 ; b++){
//            for (int a = 2 ; a > 2 ; a=+2)
        if (b<=12){
            int c = a + 2;
            int d = b + 1;
            System.out.println("兔子=");
        }
//    作业2：
//    题目：判断10-105之间有多少个素数，并输出所有素数。【素数又称为质数，定义为在大于1的自然数中，除了1和它本身以外不再有其他因数的数】
//    考点：流程控制、运算符
//    难度：中
//    作业3：
//    题目：判断100到500之间，哪些数是水仙花数。【水仙花数是指一个 n 位正整数 ( n≥3 )，它的每个位上的数字的 n 次幂之和等于它本身。（例如：1^3 + 5^3+ 3^3 = 153）】
//    考点：流程控制、运算符
//    难度：中
//    作业4：
//    题目：求1-100之间，有哪些数是完数。【完全数（Perfect number），又称完美数或完备数，是一些特殊的自然数。它所有的真因子（即除了自身以外的约数）的和（即因子函数），恰好等于它本身。例如：6=1+2+3】
//    考点：流程控制、运算符
//    难度：中
//    作业5：
//    题目：判断一个整数是几位数，并按照逆序输出。
//    考点：流程控制、运算符、数组
//    难度：中
//    作业6：
//    题目：输出2000年到3000年中的闰年。
//    考点：流程控制、运算符
//    难度：中
    }
}